
## Plan Result (tiny_virtual_machines)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 6 to change, 3 to destroy.</code></pre>

* Update
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-master0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;hela-tiny-node0&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-master1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;loki-tiny-node1&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-master2&#34;].proxmox_virtual_environment_vm.vm
  * module.tiny_k8s_virtual_machines[&#34;thor-tiny-node2&#34;].proxmox_virtual_environment_vm.vm
* Replace
  * proxmox_virtual_environment_download_file.tiny_images[&#34;hela-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;loki-jammy-server-cloudimg-amd64.img&#34;]
  * proxmox_virtual_environment_download_file.tiny_images[&#34;thor-jammy-server-cloudimg-amd64.img&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_virtual_environment_download_file.tiny_images["hela-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["loki-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # proxmox_virtual_environment_download_file.tiny_images["thor-jammy-server-cloudimg-amd64.img"] must be replaced
-/+ resource "proxmox_virtual_environment_download_file" "tiny_images" {
      ~ id                  = "local:iso/jammy-server-cloudimg-amd64.img" -> (known after apply)
      ~ size                = 669099008 -> (known after apply) # forces replacement
        # (9 unchanged attributes hidden)
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "200"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "220"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node0"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-master1"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "201"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "221"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node1"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "202"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-master2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "222"
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
        name                    = "tiny-node2"
      ~ network_interface_names = [] -> (known after apply)
      ~ started                 = false -> true
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (26 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 3 to add, 6 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiny_k8s_virtual_machines["hela-tiny-master0"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "200"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:22:1C:50",
          - "EE:EE:EE:EE:EE:EE",
          - "66:14:A9:1D:22:0E",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master0"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["hela-tiny-node0"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "220"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:91:B7:DC",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:B6:0D:3C:31:A8",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node0"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-master1"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "201"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:22:E4:A3",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "66:89:37:BA:FF:E2",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master1"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["loki-tiny-node1"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "221"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:DE:E9:1B",
          - "66:D1:CB:FC:86:3F",
          - "EE:EE:EE:EE:EE:EE",
          - "7A:C5:59:90:D6:4A",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node1"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-master2"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "202"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:8D:F5:D1",
          - "66:C2:8C:3A:2B:66",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-master2"
        tags                    = [
            "k8s",
            "k8s-control-plane",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.tiny_k8s_virtual_machines["thor-tiny-node2"].proxmox_virtual_environment_vm.vm has changed
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "222"
      ~ mac_addresses           = [
          - "00:00:00:00:00:00",
            "BC:24:11:90:65:2A",
          - "66:E0:47:EA:BA:17",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
          - "EE:EE:EE:EE:EE:EE",
        ]
        name                    = "tiny-node2"
        tags                    = [
            "k8s",
            "k8s-worker",
            "terraform",
        ]
        # (29 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":564,"Program":"tfcmt","SHA1":"","Target":"tiny_virtual_machines","Vars":{}} -->